Revit 2027 API
ParameterSet.Insert Method
Insert the specified parameter into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	Parameter item
)
Public Overridable Function Insert (
	item As Parameter
) As Boolean
public:
virtual bool Insert(
	Parameter^ item
)
abstract Insert :
        item : Parameter -> bool
override Insert :
        item : Parameter -> bool
Parameters
item Parameter
The parameter to be inserted into the set.
Return Value
Boolean
Returns whether the parameter was inserted into the set.
See Also
Reference
ParameterSet Class
Autodesk.Revit.DB Namespace